{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задача №25. \n",
    "Напишите программу, которая принимает на вход строку, и отслеживает, сколько раз каждый символ\n",
    "уже встречался. Количество повторов добавляется к символам с помощью постфикса формата _n.\n",
    "\n",
    "**Input:** a a a b c a a d c d d\n",
    "\n",
    "**Output:** a a_1 a_2 b c a_3 a_4 d c_1 d_1 d_2\n",
    "\n",
    "*Для решения данной задачи используйте функцию .split()*\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "f g f_1 e s f_2 g_1 h "
     ]
    }
   ],
   "source": [
    "stroka = input().split()\n",
    "res = {}\n",
    "\n",
    "for i in stroka:\n",
    "    if i in res:\n",
    "        print(f\"{i}_{res[i]}\", end=\" \")\n",
    "    else:\n",
    "        print(i, end=\" \")\n",
    "\n",
    "    res[i] = res.get(i, 0) + 1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задача №27. \n",
    "Пользователь вводит текст(строка). Словом считается последовательность непробельных символов идущих \n",
    "подряд, слова разделены одним или большим числом пробелов. Определите, сколько различных слов \n",
    "содержится в этом тексте.\n",
    "\n",
    "**Input:** *She sells sea shells on the sea shore The shells\n",
    "that she sells are sea shells I'm sure.So if she sells sea\n",
    "shells on the sea shore I'm sure that the shells are sea\n",
    "shore shells*\n",
    "\n",
    "**Output:** 13"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "13\n"
     ]
    }
   ],
   "source": [
    "stroka = input().split()\n",
    "\n",
    "set_1 = set()\n",
    "\n",
    "for i in stroka:\n",
    "    set_1.add(i.lower())\n",
    "\n",
    "print(len(set_1))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Задача №29. \n",
    "\n",
    "Ваня и Петя поспорили, кто быстрее решит \n",
    "следующую задачу: *“Задана последовательность\n",
    "неотрицательных целых чисел. Требуется определить\n",
    "значение наибольшего элемента\n",
    "последовательности, которая завершается первым\n",
    "встретившимся нулем (число 0 не входит в\n",
    "последовательность)”*. Однако 2 друга оказались не \n",
    "такими смышлеными. Никто из ребят не смог до \n",
    "конца сделать это задание. Они решили так: у кого \n",
    "будет меньше ошибок в коде, тот и выиграл спор. За \n",
    "помощью товарищи обратились к Вам, студентам.\n",
    "Примечание: Программные коды на следующих \n",
    "слайдах\n",
    "\n",
    "**Ваня:**\n",
    "\n",
    "n = int(input())\n",
    "\n",
    "max_number = 1000\n",
    "\n",
    "while n != 0:\n",
    "\n",
    " n = int(input())\n",
    "\n",
    " if max_number > n:\n",
    "\n",
    " max_number = n\n",
    "\n",
    "print(max_number)\n",
    "\n",
    "\n",
    "**Петя:**\n",
    "\n",
    "n = int(input())\n",
    "\n",
    "max_number = -1\n",
    "\n",
    "while n < 0:\n",
    "\n",
    " n = int(input())\n",
    "\n",
    " if max_number < n:\n",
    "\n",
    " n = max_number\n",
    " \n",
    "print(n) "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5\n"
     ]
    }
   ],
   "source": [
    "n = int(input())\n",
    "max_number = n\n",
    "while n != 0:\n",
    "\n",
    "    n = int(input())\n",
    "\n",
    "    if max_number < n:\n",
    "        max_number = n\n",
    " \n",
    "print(max_number)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Домашняя работа"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Даны два неупорядоченных набора целых чисел (может быть, с повторениями). Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.\n",
    "На вход подается 2 числа через пробел: n m\n",
    "n - кол-во элементов первого множества.\n",
    "m - кол-во элементов второго множества.\n",
    "Затем подаются элементы каждого множества через пробел в виде строки. ! Писать input() не надо\n",
    "\n",
    "Пример\n",
    "\n",
    "На входе:\n",
    "\n",
    "var1 = '5 4' # количество элементов первого и второго множества\n",
    "\n",
    "var2 = '1 3 5 7 9' # элементы первого множества через пробел\n",
    "\n",
    "var3 = '2 3 4 5' # элементы второго множества через пробел\n",
    "\n",
    "\n",
    "На выходе:\n",
    "\n",
    "3 5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 5\n"
     ]
    }
   ],
   "source": [
    "var1 = '5 4' \n",
    "var2 = '1 3 5 7 9' \n",
    "var3 = '2 3 4 5' \n",
    "\n",
    "var2_set = set(var2.split())\n",
    "var3_set = set(var3.split())\n",
    "res = list(var2_set.intersection(var3_set))\n",
    "res.sort()\n",
    "res = ' '.join(res)\n",
    "\n",
    "print(res)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Черника\n",
    "\n",
    "\n",
    "В фермерском хозяйстве в Карелии выращивают чернику. Черника растет на круглой грядке, и кусты черники высажены по окружности грядки. Каждый куст черники имеет урожайность, которая соответствует количеству ягод на этом кусте.\n",
    "\n",
    "Урожайность черничных кустов представлена в виде списка arr, где arr[i] - это урожайность (количество ягод) i-го куста.\n",
    "\n",
    "В фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из управляющего модуля и нескольких собирающих модулей. Каждый собирающий модуль может собрать ягоды с одного куста и с двух соседних кустов. Собирающий модуль находится перед определенным кустом, и он может выбирать, с какого куста начать сбор ягод.\n",
    "\n",
    "Ваша задача - написать программу, которая определит максимальное число ягод, которое может собрать один собирающий модуль за один заход, находясь перед некоторым кустом грядки.\n",
    "\n",
    "Входные данные:\n",
    "\n",
    "На вход программе подается список arr, где arr[i] (1 ≤ arr[i] ≤ 1000) - урожайность i-го куста черники. Размер списка не превышает 1000 элементов.\n",
    "\n",
    "Выходные данные:\n",
    "\n",
    "Программа должна вывести одно целое число - максимальное количество ягод, которое может собрать собирающий модуль, находясь перед некоторым кустом грядки.\n",
    "\n",
    "\n",
    "Пример использования На входе:\n",
    "\n",
    "arr = [5, 8, 6, 4, 9, 2, 7, 3]\n",
    "\n",
    "На выходе:\n",
    "\n",
    "19"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "19\n"
     ]
    }
   ],
   "source": [
    "arr = [5, 8, 6, 4, 9, 2, 7, 3]\n",
    "n = len(arr)\n",
    "arr = arr*2\n",
    "max_count = 0\n",
    "for i in range(1,n+1):\n",
    "    if sum(arr[i-1:i+2])> max_count:\n",
    "        max_count = sum(arr[i-1:i+2])\n",
    "\n",
    "print(max_count)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".folder",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
